流的抽象与路径名的抽象

## 14.1 读取文件数据

`READ-CHAR` reads a single character; `READ-LINE` reads a line of text, returning it as a string with the end-of-line character(s) removed; and `READ` reads a single s-expression, returning a Lisp object.

```
(let ((in (open "/some/file/name.txt" :if-does-not-exist nil)))
  (when in
    (loop for line = (read-line in nil)
         while line do (format t "~a~%" line))
    (close in)))
```

For instance, suppose `/some/file/name.txt` has the following contents:

```
(1 2 3)
456
"a string" ; this is a comment
((a b)
 (c d))
```

In other words, it contains four s-expressions: a list of numbers, a number, a string, and a list of lists. You can read those expressions like this:

```
CL-USER> (defparameter *s* (open "/some/file/name.txt"))
*S*
CL-USER> (read *s*)
(1 2 3)
CL-USER> (read *s*)
456
CL-USER> (read *s*)
"a string"
CL-USER> (read *s*)
((A B) (C D))
CL-USER> (close *s*)
T
```

As you saw in Chapter 3, you can use `PRINT` to print Lisp objects in "readable" form. Thus, whenever you need to store a bit of data in a file, `PRINT` and `READ` provide an easy way to do it without having to design a data format or write a parser. They even--as the previous example demonstrated--give you comments for free. And because s-expressions were designed to be human editable, it's also a fine format for things like configuration files.

## 14.4 File Output

To write data to a file, you need an output stream, which you obtain by calling `**OPEN**` with a `:direction` keyword argument of `:output`. When opening a file for output, `**OPEN**` assumes the file shouldn't already exist and will signal an error if it does. However, you can change that behavior with the `:if-exists` keyword argument. Passing the value `:supersede` tells `**OPEN**` to replace the existing file. Passing `:append` causes `**OPEN**` to open the existing file such that new data will be written at the end of the file, while `:overwrite` returns a stream that will overwrite existing data starting from the beginning of the file. And passing `**NIL**` will cause `**OPEN**` to return `**NIL**`instead of a stream if the file already exists. A typical use of `**OPEN**` for output looks like this:

```
(open "/some/file/name.txt" :direction :output :if-exists :supersede)
```

Common Lisp also provides several functions for writing data: `WRITE-CHAR`writes a single character to the stream. `WRITE-LINE` writes a string followed by a newline, which will be output as the appropriate end-of-line character or characters for the platform. Another function, `WRITE-STRING`, writes a string without adding any end-of-line characters.

## close file

```
(with-open-file (stream "/some/file/name.txt")
  (format t "~a~%" (read-line stream)))
```

To create a new file, you can write something like this:

```
(with-open-file (stream "/some/file/name.txt" :direction :output)
  (format stream "Some text."))
```

## 14.7 路径名如何表示文件名

```lisp
> (setf pn (pathname 			       "C:/code_dxf/xuefgit/Files_01_xuef/all_xuef/code/Practical_CL/unit_test_v2.lisp"))
#P"C:\\code_dxf\\xuefgit\\Files_01_xuef\\all_xuef\\code\\Practical_CL\\unit_test_v2.lisp"
> (pathname-device pn)
"C"
> (pathname-directory pn)
(:ABSOLUTE "code_dxf" "xuefgit" "Files_01_xuef" "all_xuef" "code" "Practical_CL")
> (pathname-name pn)
"unit_test_v2"
> (pathname-type pn)
"lisp"
```

```
(pathname "/foo/bar/baz.txt") ==> #p"/foo/bar/baz.txt"
(namestring #p"/foo/bar/baz.txt")           ==> "/foo/bar/baz.txt"
(directory-namestring #p"/foo/bar/baz.txt") ==> "/foo/bar/"
(file-namestring #p"/foo/bar/baz.txt")      ==> "baz.txt"
```

## 14.8 构建路径名

```
(make-pathname
  :directory '(:absolute "foo" "bar")
  :name "baz"
  :type "txt") ==> #p"/foo/bar/baz.txt"
```

不推荐手工创建路径名

For example, the following expression creates a pathname with an `.html` extension and all other components the same as the pathname in the variable `input-file`:

```
(make-pathname :type "html" :defaults input-file)
```



```
(merge-pathnames #p"foo/bar.html" #p"/www/html/") ==> #p"/www/html/foo/bar.html"
```

The second pathname can also be relative, in which case the resulting pathname will also be relative.

```
(merge-pathnames #p"foo/bar.html" #p"html/") ==> #p"html/foo/bar.html"
```

To reverse this process and obtain a filename relative to a particular root directory, you can use the handy function `ENOUGH-NAMESTRING`.

```
(enough-namestring #p"/www/html/foo/bar.html" #p"/www/") ==> "html/foo/bar.html"
```



















